# JavaCourse2022
Домашнее задание №2:
Результат работы каждой задачи должен быть выведен в консоль.
1.	Написать код, который выведет значения переменных на экран:
byte b = 0х55;
short s = 0x55ff;
int i = 1000000;
long l = 0xffffffffL;
char с = 'a' ;
float f = .25f;
double d = .00001234;
boolean bool = true;
2.	Написать метод, который принимает на вход два целых числа, делает их суммирование и складывает результат с произведением двух этих чисел, и возвращает полученный результат из метода. Передать на вход в метод любые два числа. Вывести полученный результат работы метода на экран.
3.	Задать промежуток времени в секундах в виде переменной. Следует вывести его на экран в виде часов минут и секунд, суток и недель.
4.	Создать программу, в которой последовательно прописать преобразования всех совместимых примитивных типов друг к другу. Преобразование для каждого типа вынесите в отдельный метод. Результат работы методов вывести в консоль.
5.	Создать программу, которая будет сообщать, является ли целое число чётным.
6.	Создать программу, которая будет выводить на экран меньшее по модулю из трёх вещественных чисел.


Домашнее задание №6
Задания выполняются в ветке hw6. Также необходимо создать pull request для ветки hw6 в ветку master (main).
Классы с решением заданий должны быть расположены в пакете by.itacademy.hw6. 
Каждое задание выполняется в отдельном классе, имеющем название TaskN, где N - порядковый номер выполняемой задачи. 
1. Вводится ненормированная строка, у которой могут быть пробелы в начале, в конце и между словами более одного пробела. Привести ее к нормированному виду, т.е. удалить все пробелы в начале и конце, а между словами оставить только один пробел.
2. Введите строку (текст). Найдите наибольшее количество идущих подряд цифр.
3. Поменяйте местами первое самое длинное слово с последним самым коротким.
4. Решить задачу с помощью класса StringBuilder
●	Дано два числа, например 3 и 56, необходимо составить следующие строки:
 3 + 56 = 59
 3 – 56 = -53
3 * 56 = 168.
●	Замените символ “=” на слово “равно”.
5. Напишите метод, заменяющий в строке каждое второе вхождение «object-oriented programming» (не учитываем регистр символов) на «OOP». Например, строка 
"Object-oriented programming is a programming language model organized around objects rather than "actions" and data rather than logic. Object-oriented programming blabla. Object-oriented programming bla."
должна быть преобразована в 
"Object-oriented programming is a programming language model organized around objects rather than "actions" and data rather than logic. OOP blabla. Object-oriented programming bla."
6. Дана строка “Versions: Java  5, Java 6, Java 7, Java 8, Java 12.”  Найти все подстроки "Java X" и распечатать их.
7. Практика методов классов оберток
●	Создайте объекты класса Double, используя методы valueOf(). 
●	Преобразовать значение типа String к типу double. Используем метод Double.parseDouble().
●	Преобразовать объект класса Double ко всем примитивным типам.
●	Вывести значение объекта Double на консоль. 
●	Преобразовать литерал типа double к строке: String d = Double.toString(3.14);
8. Шестнадцатеричный цвет. Символ # (необязательно), затем слово, состоящее из букв от a до f или цифр, длиной 3 или 6: 
Пример: 
●	FFFFFF
●	 #000 
●	101011
9. Email. Общий вид — логин@поддомен.домен. Логин, как и поддомен — слова из букв, цифр, подчеркиваний, дефисов и точек. А домен (имеется в виду 1го уровня) — это от 2 до 6 букв. 
Пример:
●	 myemail@gmail.com 
●	 a.petrov@gmail.com.au
●	 coder4575@yandex.ru


Домашнее задание №7
Задания выполняются в ветке hw7. Также необходимо создать pull request для ветки hw7 в ветку master (main).
Классы с решением заданий должны быть расположены в пакете by.itacademy.hw7. 
Каждое задание выполняется в отдельном пакете, имеющем название taskN, где N - порядковый номер выполняемой задачи. При решении задач руководствоваться принципами ООП. 
1. Реализуйте класс студента и аспиранта. Аспирант отличается от студента наличием научной работы. Студент обладает следующими характеристиками имя, фамилия, номер курса, название группы, средняя оценка. У студента должен быть реализован метод, возвращающий сумму стипендии, которая рассчитывается следующим образом: если средняя оценка равна 5, то сумма 100, иначе 80. Стипендия аспиранта рассчитывается иначе: если средняя оценка равна 5, то сумма 200, иначе 180. 
Продемонстрировать работу программы, создав массив, содержащий студентов и аспирантов. Вывести на экран информацию о каждом студенте и аспиранте (имя, фамилия, номер курса, название группы, средняя оценка, размер стипендии).
2. Напишите классы для конвертации из градусов по Цельсию в
Кельвины и Фаренгейты.
3. Класс Фрукт содержит: 
●	переменную вес, 
●	метод printManufacturerInfo(){System.out.print("Made in Belarus");}
●	абстрактный метод, возвращающий стоимость фрукта. Метод должен учитывать вес.
Собрать корзину из яблок, груш и абрикосов. Подсчитать ее общую стоимость и общую стоимость по каждому виду фрукта.
4. Реализовать иерархию цветов (розы, ромашки и т.п.).
●	Создать несколько объектов-цветов.
●	Собрать букет и определить его стоимость.
●	Определить все цвета, используемые в букете.
●	Определить когда весь букет завянет.
